<?php get_header(); ?>
<?


/* $metroArray = array(
 												'Это новая вакансия 2',
 												'Это новая вакансия 3',
 												'Это новая вакансия 4',
 												'Это новая вакансия 5',
 												'Это новая вакансия 6',
 												'Это новая вакансия 7',
 											);
  foreach ($metroArray as $value) {
  	$title =  $value;
  	$content =   '<h1>Заголовок 1</h1>
<p>Что все же лучше использовать в xvi веке языке. Он веб-дизайнерами для вставки на том языке, который планируется использовать. Руку при запуске проекта имеет никакого отношения. Вопросы, связанные с использованием lorem ipsum на кириллический контент. Широко используемый и смысловую нагрузку ему нести совсем. Вырвал отдельные фразы и на латыни. Цицерону, ведь именно из. Пределах добра и проектах, ориентированных на название, не имеет никакого отношения. При запуске проекта зла средневековый книгопечатник вырвал. Применения такого текста на основе оригинального трактата благодаря. Частотой, имеется разница в. Веб-дизайнерами для вставки на кириллический контент – написание символов.</p>
<h1>Заголовок 2</h1>
<p>– написание символов на основе оригинального трактата благодаря. Напрашивается вывод, что все же лучше использовать при оценке качества. Исключительно демонстрационная, то и даже. Такого текста исключительно демонстрационная, то и смысловую нагрузку ему нести совсем. Могут возникнуть небольшие проблемы: в различных языках. Исключительно демонстрационная, то и демонстрации внешнего вида. Появлением lorem частотой, имеется разница. Длинный неповторяющийся набор слов. применили в книгопечатании еще в. Ipsum, кроме того, нечитабельность текста сыграет на интернет-страницы и т.д его применили. Лучше использовать при оценке качества восприятия макета благодаря. Текст-рыбу, широко используемый и слова, получив текст-рыбу.</p>
<h3>Заголовок 3</h3>
<p>И демонстрации внешнего вида контента, просмотра шрифтов, абзацев отступов. Нагрузку ему нести совсем необязательно появляется возможность получить более того есть. Философу цицерону, ведь именно из его трактата о пределах добра. Текстом является знаменитый lorem используемый. Частотой, имеется разница в качестве рыбы текст на название. Абзацев, отступов и т.д каждый веб-разработчик знает, что такое текст-рыба вида контента. Не имеет никакого отношения к обитателям водоемов демонстрации. Рыбы текст этот, несмотря на руку. Рыбным текстом является знаменитый lorem те. Использующими латинский алфавит, могут возникнуть небольшие проблемы: в различных языках. Варианты текста на кириллице значительно различается текст на руку.</p>
<h4>Заголовок 4</h4>
<p>Не имеет никакого отношения к обитателям водоемов имеется разница. Специальные генераторы, создающие собственные варианты текста исключительно демонстрационная, то и. Символов на основе оригинального трактата, благодаря чему. Используемый и даже с использованием lorem с языками, использующими латинский алфавит. По сей день сегодня существует несколько вариантов lorem запуске проекта сайтах. Возникают некоторые вопросы, связанные с языками, использующими латинский алфавит. Символов на кириллический контент – написание символов на основе оригинального трактата благодаря. Пределах добра и даже с разной частотой, имеется разница. Алфавит, могут возникнуть небольшие проблемы: в длине наиболее. Так как цель применения такого текста на название.</p>
<p>Того, есть специальные генераторы, создающие собственные варианты текста. Имеется разница в книгопечатании еще в книгопечатании еще в качестве. Кириллице значительно различается совсем необязательно совсем необязательно генераторы, создающие собственные. Могут возникнуть небольшие проблемы. Этот, несмотря на сайтах и проектах, ориентированных на руку при запуске проекта. Нести совсем необязательно могут возникнуть небольшие проблемы: в книгопечатании еще. Пределах добра и т.д знаменитый lorem впервые его применили в качестве. Небольшие проблемы: в xvi веке разница в различных языках те или иные. Знаменитый lorem ipsum на кириллический контент – написание символов. Конечно, возникают некоторые вопросы, связанные с разной частотой имеется.</p>
<p>Связанные с языками, использующими латинский алфавит, могут возникнуть небольшие. Из его применили в качестве рыбы. Небольшие проблемы: в xvi веке значительно различается различных языках. Отдельные фразы и смысловую нагрузку. Является знаменитый lorem ipsum на. Широко используемый и по сей день контента, просмотра шрифтов. Вырвал отдельные фразы и т.д генераторы, создающие собственные варианты текста. Каждый веб-разработчик знает, что впервые его трактата о пределах добра и смысловую. Имеется разница в качестве рыбы текст этот, несмотря. Все же лучше использовать в длине наиболее. Xvi веке ipsum, кроме того, нечитабельность текста исключительно.</p>';
  	 $post_data = array(
		 'post_title'    => $title,
		 'post_content'  => $content,
		 'post_status'   => 'publish',
		 'post_author'   => 1,
		 'post_category' => array(15),
	
	  );
	$post_id = wp_insert_post( wp_slash($post_data) );
}*/
?>
<!--block header end-->
<div class="container-general">
	<!--block bread-->
	<div class="main-cont">
		<?php if( function_exists('kama_breadcrumbs') ) kama_breadcrumbs(); ?>
	</div>
	<!--block bread end-->
	<div class="main-cont">
		
		<div class="title-page  type--icon">
			<?php if (get_field('icon')): ?>
				<div class="title-icon title-icon--orange">
					<svg class="icon">
						<use xlink:href="#<?=get_field('icon');?>"></use>
					</svg>
				</div>
			<?php endif ?>
			<?=get_the_title(); ?>
		</div>
		<div class="container container--content">
			<div class="container__info container__info--light">
				<?
					while (have_posts()) : the_post(); 
						echo the_content();
				   endwhile; 
				   wp_reset_query(); 
				?>
			</div>
			<div class="container__toolbar">
				<!--block reward-->
				<? include('include/reward.php');?>
				<!--block reward end-->

				<!--block knowlage-->
				<? include('include/knowlage.php');?>
				<!--block knowlage end-->

				<!--block keys-->
				<? include('include/keys.php');?>
				<!--block keys end-->
			</div>
		</div>
	</div>
</div>
<!--block slider-clients-->

<?php get_footer(); ?>